OF_article_cases/2DCylinderUniformGranularFlow/Case1D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rbgh
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.000;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rbghFinal
    {
        $p_rbgh;
        tolerance       1e-8;
        relTol          0;
    }

    "(k|epsilon|omega|pa|alphaPlastic)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0.0000;
    }

    "(kFinal|epsilonFinal|omegaFinal|paFinal|alphaPlasticFinal)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0;
    }

    "U.a|U.aFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    "U.b|U.bFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    alpha.a
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
    alpha.aFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
    Theta
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
    ThetaFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
}

relaxationFactors
{
    fields
    {
        p_rbgh               0.8;
    }
    equations
    {
        U.a            0.7;
        U.b            0.7;
        Ua            0.7;
        Ub            0.7;
        k             0.9;
        omega         0.9;
    }
}

PIMPLE
{
    momentumPredictor 0;
    nOuterCorrectors  2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    correctAlpha    1;
    nAlphaCorr      1;
    pRefCell        0;
    pRefValue       0;
}
// ************************************************************************* //
