OF_article_cases/2DCylinderUniformGranularFlow/Case1D/Allrun
#!/bin/sh

# create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Initialize the alpha field
setFields

## Run sedFoam in parallel
sedFoam_rbgh  > log&
